@Zhaph , thanks for submitting this issue.
Seems I can successfullly provision with the provided config. I am using the `westus` location, for my test subscription does not support VM in `westus2` . This should be service API issue. Could please help provide logs by running `TF_LOG=DEBUG TF_LOG_PATH=~/tf.log terrafrom apply`?

<details>

```
-> % terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_monitor_autoscale_setting.example will be created
  + resource "azurerm_monitor_autoscale_setting" "example" {
      + enabled             = false
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "wt-asp-example-ass"
      + resource_group_name = "wt-test-rg1"
      + target_resource_id  = (known after apply)

      + notification {
          + email {
              + custom_emails                         = []
              + send_to_subscription_administrator    = false
              + send_to_subscription_co_administrator = false
            }
        }

      + profile {
          + name = "Default"

          + capacity {
              + default = 2
              + maximum = 3
              + minimum = 2
            }

          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 65
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT15M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + metric_name        = "CpuPercentage"
                  + metric_namespace   = "microsoft.web/serverfarms"
                  + metric_resource_id = (known after apply)
                  + operator           = "LessThan"
                  + statistic          = "Average"
                  + threshold          = 40
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT30M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "wt-test-rg1"
    }

  # azurerm_service_plan.example will be created
  + resource "azurerm_service_plan" "example" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "wt-asp-example"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "wt-test-rg1"
      + sku_name                     = "P0v3"
      + worker_count                 = 2
    }

Plan: 3 to add, 0 to change, 0 to destroy.
azurerm_resource_group.example: Creating...
azurerm_resource_group.example: Creation complete after 2s [id=/subscriptions/xxx/resourceGroups/wt-test-rg1]
azurerm_service_plan.example: Creating...
azurerm_service_plan.example: Still creating... [10s elapsed]
azurerm_service_plan.example: Creation complete after 14s [id=/subscriptions/xxx/resourceGroups/wt-test-rg1/providers/Microsoft.Web/serverfarms/wt-asp-example]
azurerm_monitor_autoscale_setting.example: Creating...
azurerm_monitor_autoscale_setting.example: Creation complete after 8s [id=/subscriptions/xxx/resourceGroups/wt-test-rg1/providers/Microsoft.Insights/autoScaleSettings/wt-asp-example-ass]
```

</details>